Catalogs/Упражнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Упражнения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/УпражненияИГруппыМышц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>УпражненияИГруппыМышц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаМышц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыМышц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упражнение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Упражнения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Упражнения/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ГруппаМышц") Тогда
		
		Владелец = Параметры.ГруппаМышц;	
		ОбновитьСписокУпражнений(Владелец);
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУпражнение(Команда)
	
	ПараметрыФормы = Новый Структура("Владелец",Владелец);
	ОткрытьФорму("Справочник.Упражнения.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписаноУпражнение" Тогда
		Элементы.Список.Обновить();
		ОбновитьСписокУпражнений(Владелец);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокУпражнений(ГруппаМышц)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпражненияИГруппыМышц.Упражнение
	               |ИЗ
	               |	РегистрСведений.УпражненияИГруппыМышц КАК УпражненияИГруппыМышц
				   |ГДЕ
				   |	УпражненияИГруппыМышц.ГруппаМышц = &ГруппаМышц";
				   
	Запрос.УстановитьПараметр("ГруппаМышц",ГруппаМышц);
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	СписокСсылок = Новый СписокЗначений;
	
	Для Каждого ТекСтрока Из РЗ Цикл
		СписокСсылок.Добавить(ТекСтрока.Упражнение,ТекСтрока.Упражнение);
	КонецЦикла;

	Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = СписокСсылок;		
	
КонецПроцедуры
